export const dualist = [
  {
    title: 'Көркем есімдермен мінәжат',
    desc: `«Ең көркем есімдер Аллаға тән. Ендеше, Оған сол есімдерімен үн қатып, дұға етіңдер»
    «Ағраф» сүресі, 180-аят.
    
    •	Уа, күллі тіршілік атаулының жалғыз Жаратушысы, барлық көркем есімдер мен кемел сипаттардың шынайы иесі – ұлы Аллам;
    •	Уа, әрбір нәрсені теңдессіз тәрттіппен реттеп тұрған – бүкіл ғаламның Раббы Аллам;
    •	Уа, теңдесі жоқ, сипаты мен істерінде еш серігі жоқ, жалғыз – Ахад Аллам;
    •	Уа, шет-шегі жоқ ғаламзатты мейірімімен тербеткен – аса рақымды Рахмаан Аллам; 
    •	Уа, бар жаратылысты мүлтіксіз жүйемен ұстап тұрған шексіз құдірет иесі – Қаййуум Аллам;
    •	Уа, жер мен көкті, бүкіл болмысты нұрға бөлеген – Муниир Аллам;
    •	Уа, барлық жаратылыс Оған зәру, бірақ Өзі ешкімге мұқтаж емес – Самад Аллам;
    •	Уа, Күрсі мен Арштың, Қалам мен Ләухтың, Қағба мен Құранның иесі – ұлы Аллам;
    •	Уа, жердің асты-үстіндегі тұтас тіршілікті һәм аспандағы ұшқан құсты, су түбіндегі барша жаратылысты түрлі нығметімен рызықтандырушы – Раззаақ Аллам;
    •	Уа, білімі күллі ғаламдағы жария-жасырын, үлкен-кіші көмескінің бәрін толық қамтыған шексіз ілім иесі – Алиим Аллам;
    •	Уа, бар болмысты көркем жаратып, әрбір жаратылысты әсем безендіруші – Жәмиил Аллам;
    •	Уа, барлық мадақ пен мақтауға ең лайықты –  Хамиид Аллам;
    •	Уа, күнәһар пенделерін дереу жазаламай, оларға тәубе етуі үшін мұрсат беруші, сабырлы да аса биязы – Хәлиим Аллам;
    •	Уа, барлық істі аса даналықпен, терең хикметпен жасаушы – Хакиим Аллам;
    •	Уа, ізгі құлдарына молынан сый-сияпат беруші аса жомарт – Кәриим Аллам;
    •	Уа, барлық құлдарына, тіпті өзінен сырт айналып, адасқандарға да мейірбандық танытушы – Хәннаан Аллам;
    •	Уа, барша ғаламға сансыз жақсылығы мен есепсіз игілігін тарту етуші – Мәннаан Аллам;
    •	Уа, жасаған амалдарымыздың ешбірін ескерусіз қалдырмай, сауабы мен қарымын толық беруші – Дәййаан Аллам;
    •	Уа, құлдарының күнәлары мен кемшілігін жасырып, оларды масқаралықтан сақтаушы – Саттаар Аллам;
    •	Уа, барша ақиқаттың дәлелі – Бұрһаан Аллам;
    •	Уа, шексіз салтанат пен шынайы биліктің асқақ иесі, билеушілердің билеушісі, патшалардың патшасы – Сұлтаан Аллам;
    •	Уа, барша дүние-мүліктің жалғыз қожайыны – Мәлик Аллам;
    •	Уа, кемшіліктен пәк, нұқсандық атаулыдан ада, еш мінсіз – Субхаан Аллам; 
    •	Уа, барлық нәрсенің бастауы – Әууал Аллам,
    •	Уа, бүкіл жаратылыстың ақыры – Аахир Аллам,
    •	Уа, бар болуы мен жалғыз екендігі айқын-аян – Зааһир Аллам;
    •	Уа, кемел сипаттарының сыры мен істерінің ақиқи хикметіне ақыл жетпейтін – Бәәтин Аллам;
    •	Уа, бүкіл тіршілік атаулы жәрдем тілеп, көмек сұрайтын жалғыз жәрдемші, аса қамқор – Мұстағаан Аллам;
    •	Уа, бүкіл жаманшылықтан сақтап, түрлі пәлекет пен қауіп-қатерден қорғаушы – Хафииз Аллам;
    •	Уа, жан сырымыз бен көмескі құпиямызды білуші − Хабиир Аллам;
    •	Уа, бүкіл жария-жасырын дұғаларымызды бір сәт шатастырмай анық естуші, тілегімізді беруші – Самииғ Аллам;
    •	Уа, тыңнан мүмкіндік сыйлаушы, жабық есіктерді айқара ашушы – Фаттаах Аллам;
    •	Уа, бүкіл болмыстан биік, күллі жаратылыстан ұлы – Алий Аллам, 
    •	Уа, мәңгі таусылмайтын қазына иесі – Ғаний Аллам, 
    •	Уа, барша науқастың жан-тәніне дауа дарытушы, шипасын беруші – Шаафии Аллам,
    •	Уа, адасқандарды тура жолға салушы, шатасқандарды ақиқатқа жетелеуші – Һәәди Аллам;
    •	Уа, тарыққандарға пана, қиналғандарға қорған болушы – Уәкиил Аллам;
    •	Уа, астамдық жасағандарға тосқауыл қоюшы, шектен шыққан залымдарға жазасын беріп, қаһарын көрсетуші – Қаһһаар да  Жаббар Аллам;
    •	Уа, күллі тіршілікті пәнилікке бас идірткен мәңгіліктің шын иесі – Баақи Аллам;
    •	Уа, бар жаратылысқа тіршілік сыйлап, өмір беретін һәм өлілерді қайта тірілтуші – мәңгілік тірі Хаии Аллам;
    •	Уа, қалаған пендесінің дәрежесін биіктетіп, қалағанының абыройын түсіруші құдіретті Аллам;
    •	Уа, мына дүниеде жасаған әр ісіміздің есебін алып, қарымын беруші – Хасииб Аллам;
    •	Уа, барлық нәрсені толық көруші – Басиир Аллам;
    •	Уа, бүкіл жаратылысты дамылсыз һәм мінсіз бақылаушы – Рақииб Аллам;
    •	Уа, біліп-білмей, жария-жасырын жасаған бар күнәмізді кешіруші – Ғаффаар Аллам;
    •	Уа, жалғыз қалғанда тастап кетпейтін сенімді Сүйенішім, жырақта жұбаныш табар Сырласым, қамыққанда медет берер Демеушім, мұқтаж сәтте көмек берер Жардемшім, қысылғанда бас сауғалайтын жалғыз Панам, бойдағы үрей-қорқынышымды сейілтер Қорғанышым, абыржып, сасқан сәтте жол көрсетер Жолбасшым!
    •	Уа, Мейірбан Аллам, осынау көркем есімдеріңді дәнекер етіп, ұлы сипаттарыңның ақы-құрметі үшін, бір Өзіңе сиына отырып, жалғыз Өзіңнен жалбарына сұраймын:
    Бізді тура жолға сала көр. Адасып, шатасудан сақта. Көкірегімізді иманға, ізгілікке, нұрға, қанағат, мейірімге толтыр!
    Жаратылысымызды әдемі еткеніңдей, мінезімізді де көркем ет.
    Жүрегімізді күнәнің дағынан тазартып, тәкаппарлық, қызғаныш, өкпе-реніш, кектен, көзбояушылықтан, дүниеқоңыздықтан сақтай көр! 
    Рахман ием, біздің жасаған күнәміз қанша көп болса да, Сенің кешірімің мен мейірімің одан да зор. Бар жасаған қателерімдізді кешіре көр!
    Уа, Раббымыз, бізді нәпсімізбен бір мезет жеке қалдыра көрме. Әрдайым өзің қолдап, қорға! Өзің жақсы көретін, риза болатын істерде бізді жетістікке жеткіз.
    Уа, бүкіл әлемнің Раббысы, ел қызметінде жүрген басшыларымыздың жүрегіне иман мен ынсап бергейсің. Оларды қате шешімдерден сақтап, халқымызды әділ басқаруға жәрдем бергейсің.
    Мейірбан Аллам, бізді тәрбиелеп өсірген ата-анамыздан риза болып, оларды рақымыңа бөлей көр!
    Ұрпағымыздың санасына сәуле ұялатып, жүрегіне ынсап пен мейіріміңді төге көр! Ізгі құлдарыңның қатарына қосып, Мұхаммед пайғамбарға (с.а.у.) лайықты үмбет еткейсің.
    Уа, түгесілмейтін қазына иесі дархан Аллам, рызық-несібемізді адал һәм берекесімен бергейсің. Өзіңнен басқа ешкімге мұқтаж ете көрме!
    Шаафий Аллам, дертімізге дауа дарытып, науқастарға шипаңды бере көр! 
    Құдай тағалам, бізді ақырзаманның бүлігінен, қабірдің азабынан, тозақтың отынан сақта!
    Елімізді ішкі даудан, сыртқы жаудан сақта, елдігімізді баянды ет!
    Уа, Раббым, мына дүниеде ұялмайтындай ғұмыр сүруді, құзырыңа жарқын жүзбен баруды нәсіп ет!
    Фирдаус жәннатың мен Өзіңнің дидар-жүзіңді көру бақыты бұйырған салиқалы құлдарыңның қатарына қоса көр!
    Әмин! Әмин! Әмин!
      #kemeladam `
  },
  {
    title: 'Таңғы дұғалар',
    desc: `Бізді өлгеннен кейін қайта тірілткен, ұйқыдан соң тағы да өмір берген Аллаға мадақ. Соңында бәріміз Аллаға қайтамыз. 
    Өзіңнен басқа Құдай жоқ. Сен барлық кемшілік атаулыдан пәксің! 
     Уа, Раббым, бар күнәмді кешіріп, рақымыңа бөлей гөр! 
    
    *
    Уа, Аллам білімімді арттыр, өзің тура жолға салып, һидаят еткеннен кейін мені қайта адастыра көрме! Рақымыңа бөлей көр! Сөзсіз сен бар игіліктің иесісің!
    
    *
    
    “Уа, мәңгі тірі Хаии Аллам!  Уа, бар жаратылысты мүлтіксіз жүйемен ұстап тұрған шексіз құдірет иесі – Қаййуум Аллам!Сенің рақымыңды паналап, бір өзіңнен жәрдем тілеймін. Менің барлық істерімді дұрыстап, түзелте көр. Мені бір мезет нәпсіммен жеке қалдыра көрме!” 
    
    *
    
    “Алланың есімі  айтылғанда жердегі және көктегі ешбір нәрсе зиянын тигізе алмайтын Алланың атымен жәрдем тілеп, қорғанамын.”
    `
  },
  {
    title: 'Кешірім сұрап, тәубе ету дұғалары',
    desc: `«Уа, Алла тағалам, Сен менің ұлы Раббымсың. Сен мені жараттың. Мен бір өзіңнің құлыңмын. Шамамның жеткенінше өзіңе берген уәдем мен сертімде тұруға тырысамын. Істеген жаманшылықтарымнан бір өзіңе сиынамын. Маған берген нығмет-жақсылықтарыңа қарыздармын. Жасаған барша күнәмді мойындаймын. Мені кешіре гөр. Күнәларымды Өзіңнен басқа ешкім кешіре алмақ емес».

    *
    
    «Уа, Аллам, менің барша қателігімді, білімсіздігімді, барша ісімдегі шектен шыққан кездерімді кешіре гөр. Жаратқан ием, менің біліп-білмей, шындап және әзілдеп жасаған қателіктерімді кешіре гөр. Алла тағалам, бұрынғы және кейінгі, жасырын-жария жасаған барлық күнәларымды кешіре гөр. Менен де жақсы білетін басқа күнәларымды кешіре гөр. Сенің құдіретің барлық нәрсеге толық жетеді».
    `
  },
  {
    title: 'Жатарда оқылатын дұғалар',
    desc: `«Рызығымды нәсіп еткен, паналайтын орын берген, ішкізіп, жегізген Аллаға мадақ. Маған ең керемет түрде жақсылығын мол етіп тарту еткен Аллаға мадақ. Барлық  хәліме Өзіңе шүкір етіп, мадақ айтамын. Аллам барлық жаратылыстың Раббы әрі Иесі. Барлық нәрсе Оған тиесілі. Уа, Аллам, өзіңмен тозақ отынан сақтанамын»

    *
    Уа, Аллам, жан-тәнімді өзіңе тәсілім етіп, жүзімді  саған бұрдым. Істерімді тек өзіңе тапсырдым. Өзіңнен имене үміт ете отырып арқамды саған сүйедім. Өзіңнен басқа панам да, сүйенер қорғаным да жоқ. Өзің түсірген кітабың – Құранға, жіберген ардақты пайғамбарың – Мұхаммедке (с.а.у.) иман келтірдім!”
    `
  },
  {
    title: 'Сапар дұғасы',
    desc: `Мына көлікті қызметімізге беріп, бізге бағындырған кемшіліктен пәк бір Аллаға мадақ. Алланың жәрдемінсіз біз бұған қол жеткізе алмас едік. Соңында сөзсіз бәріміз Аллаға қайтамыз.
    Уа, Алла, бұл сапарамызды жақсылық пен тақуалыққа, өзің риза болатын салиқалы істерге толтыра гөр. Уа, Раббымыз,  сапарымызды жеңіл етіп, алыстығын  жақындата гөр. 
    Уа, Алла, сапар бойы бір Өзің бізге жолдас болып, арта қалған бала-шағамызға тағы да Өзің қорған болғайсың. 
    Уа, Раббымыз, жолаушылық кезінде қиыншылыққа тап болудан, қайтып келгенде  бала-шағамыз бен дүние-мүлкіміздің жаман жағдайға душар болғанын көруден бір өзіңе сиынамыз.`
  }
]
